// 0. Демонстрация решения
// Напишите программу, которая 
// 1. на вход принимет число
// 2. выдает его квадрат
// 3. Вывод результата

// Например:
// 4 -> 16
// 3 -> 9

//Решение:
Console.Write("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine()); // Convert.ToInt32 для ковертация в целое чилсо 
int square = number * number;
Console.WriteLine($"Квадрат числа {number} = {square}");



// string str1 = Console.ReadLine();
// double d = 4.545; //flout
// string str = "wqqw34123q./.'l";
// -2 147 483 648 до 2 147 483 648







